## Terraform Plan Results

<details>
<summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # fastly_service_vcl.mealfinding is tainted, so must be replaced
-/+ resource "fastly_service_vcl" "mealfinding" {
      + active_version     = (known after apply)
      ~ cloned_version     = 1 -> (known after apply)
      ~ force_refresh      = false -> (known after apply)
      ~ id                 = "4MeaA16xaAFCmrI4UUXwk2" -> (known after apply)
      ~ imported           = false -> (known after apply)
        name               = "mealfinding-production"
      + staged_version     = (known after apply)
        # (8 unchanged attributes hidden)

      - backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      - backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
      + backend {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }

      - cache_setting {
          - action          = "pass" -> null
          - cache_condition = "is_api_request" -> null
          - name            = "pass_api_requests" -> null
          - stale_ttl       = 0 -> null
          - ttl             = 0 -> null
        }
      + cache_setting {
          + action          = "pass"
          + cache_condition = "is_api_request"
          + name            = "pass_api_requests"
        }

      - header {
          - action        = "delete" -> null
          - destination   = "http.Server" -> null
          - ignore_if_set = false -> null
          - name          = "remove_server" -> null
          - priority      = 50 -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "delete" -> null
          - destination   = "http.X-Powered-By" -> null
          - ignore_if_set = false -> null
          - name          = "remove_x_powered_by" -> null
          - priority      = 50 -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "set" -> null
          - destination   = "http.Content-Security-Policy" -> null
          - ignore_if_set = false -> null
          - name          = "add_csp" -> null
          - priority      = 100 -> null
          - source        = "\"default-src 'self'; script-src 'self' 'unsafe-inline' 'unsafe-eval'; style-src 'self' 'unsafe-inline'; img-src 'self' data: https:; font-src 'self' data:; connect-src 'self' https://api.mealfinding.com\"" -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "set" -> null
          - destination   = "http.Referrer-Policy" -> null
          - ignore_if_set = false -> null
          - name          = "add_referrer_policy" -> null
          - priority      = 100 -> null
          - source        = "\"strict-origin-when-cross-origin\"" -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "set" -> null
          - destination   = "http.Strict-Transport-Security" -> null
          - ignore_if_set = false -> null
          - name          = "add_hsts" -> null
          - priority      = 100 -> null
          - source        = "\"max-age=31536000; includeSubDomains; preload\"" -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "set" -> null
          - destination   = "http.X-Content-Type-Options" -> null
          - ignore_if_set = false -> null
          - name          = "add_xcto" -> null
          - priority      = 100 -> null
          - source        = "\"nosniff\"" -> null
          - type          = "response" -> null
        }
      - header {
          - action        = "set" -> null
          - destination   = "http.X-Frame-Options" -> null
          - ignore_if_set = false -> null
          - name          = "add_xfo" -> null
          - priority      = 100 -> null
          - source        = "\"SAMEORIGIN\"" -> null
          - type          = "response" -> null
        }
      + header {
          + action        = "delete"
          + destination   = "http.Server"
          + ignore_if_set = false
          + name          = "remove_server"
          + priority      = 50
          + regex         = (known after apply)
          + source        = (known after apply)
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "delete"
          + destination   = "http.X-Powered-By"
          + ignore_if_set = false
          + name          = "remove_x_powered_by"
          + priority      = 50
          + regex         = (known after apply)
          + source        = (known after apply)
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.Content-Security-Policy"
          + ignore_if_set = false
          + name          = "add_csp"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"default-src 'self'; script-src 'self' 'unsafe-inline' 'unsafe-eval'; style-src 'self' 'unsafe-inline'; img-src 'self' data: https:; font-src 'self' data:; connect-src 'self' https://api.mealfinding.com\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.Referrer-Policy"
          + ignore_if_set = false
          + name          = "add_referrer_policy"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"strict-origin-when-cross-origin\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.Strict-Transport-Security"
          + ignore_if_set = false
          + name          = "add_hsts"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"max-age=31536000; includeSubDomains; preload\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.X-Content-Type-Options"
          + ignore_if_set = false
          + name          = "add_xcto"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"nosniff\""
          + substitution  = (known after apply)
          + type          = "response"
        }
      + header {
          + action        = "set"
          + destination   = "http.X-Frame-Options"
          + ignore_if_set = false
          + name          = "add_xfo"
          + priority      = 100
          + regex         = (known after apply)
          + source        = "\"SAMEORIGIN\""
          + substitution  = (known after apply)
          + type          = "response"
        }

      - request_setting {
          - bypass_busy_wait = false -> null
          - force_miss       = false -> null
          - force_ssl        = true -> null
          - max_stale_age    = 0 -> null
          - name             = "force_ssl" -> null
          - timer_support    = false -> null
        }
      + request_setting {
          + bypass_busy_wait = false
          + force_miss       = false
          + force_ssl        = true
          + name             = "force_ssl"
          + timer_support    = false
        }

        # (10 unchanged blocks hidden)
    }

  # fastly_tls_subscription.mealfinding will be created
  + resource "fastly_tls_subscription" "mealfinding" {
      + certificate_authority   = "lets-encrypt"
      + certificate_id          = (known after apply)
      + common_name             = "mealfinding.com"
      + configuration_id        = (known after apply)
      + created_at              = (known after apply)
      + domains                 = [
          + "api.mealfinding.com",
          + "mealfinding.com",
          + "www.mealfinding.com",
        ]
      + force_destroy           = false
      + force_update            = false
      + id                      = (known after apply)
      + managed_dns_challenge   = (known after apply)
      + managed_dns_challenges  = (known after apply)
      + managed_http_challenges = (known after apply)
      + state                   = (known after apply)
      + updated_at              = (known after apply)
    }

  # fastly_tls_subscription_validation.mealfinding will be created
  + resource "fastly_tls_subscription_validation" "mealfinding" {
      + id              = (known after apply)
      + subscription_id = (known after apply)
    }

Plan: 3 to add, 0 to change, 1 to destroy.

Changes to Outputs:
  + active_version      = (known after apply)
  + service_id          = (known after apply)
  + tls_dns_challenges  = (known after apply)
  + tls_state           = (known after apply)
  + tls_subscription_id = (known after apply)

```

</details>

**Workflow Run:** https://github.com/sword42/mealfinding-cdn/actions/runs/20709072141
